[
    {
        "name": "Full Orbit",
        "brand": "Glossier",
        "link": "https://www.glossier.com/products/full-orbit?variant=44181679898869",
        "ingredients": "WATER/AQUA/EAU, GLYCERIN, NIACINAMIDE, PENTAERYTHRITYL TETRAISOSTEARATE, C13-15 ALKANE, PROPANEDIOL, SORBITAN OLIVATE, CETEARYL OLIVATE, BUTYROSPERMUM PARKII¬ (SHEA) BUTTER, C15-19 ALKANE, PENTYLENE GLYCOL, SODIUM HYALURONATE, PANTHENOL, BIOTIN, JASMINUM SAMBAC (JASMINE) FLOWER EXTRACT, CRATAEGUS MONOGYNA FLOWER EXTRACT, CARTHAMUS TINCTORIUS (SAFFLOWER) OLEOSOMES, PLANKTON EXTRACT, SODIUM POLYGLUTAMATE, HYDROXYACETOPHENONE, MALTODEXTRIN, CETYL PALMITATE, GLUCONOLACTONE, GLYCERYL STEARATE, GLYCERYL UNDECYLENATE, GLYCERYL LAURATE, ETHYLHEXYLGLYCERIN, ISOHEXADECANE, XANTHAN GUM, SCLEROTIUM GUM, HYDROXYETHYL ACRYLATE/SODIUM ACRYLOYLDIMETHYL TAURATE COPOLYMER, CETEARYL ALCOHOL, TETRASODIUM GLUTAMATE DIACETATE, SORBITAN PALMITATE, SORBITAN ISOSTEARATE, POLYSORBATE 60, CITRIC ACID, SODIUM HYDROXIDE, SODIUM BENZOATE, 1, 2-HEXANEDIOL, CAPRYLYL GLYCOL.",
        "similarity_score": 1.0
    },
    {
        "name": "Cleanser Concentrate",
        "brand": "Glossier",
        "link": "https://www.glossier.com/products/cleanser-concentrate?variant=43781982060789",
        "ingredients": "WATER/AQUA/EAU, DECYL GLUCOSIDE, COCAMIDOPROPYL BETAINE, CHAMOMILLA RECUTITA (MATRICARIA) FLOWER WATER, SODIUM LAUROYL SARCOSINATE, GLYCERIN, SODIUM LAUROYL LACTYLATE, NIACINAMIDE, VITIS VINIFERA (GRAPE) JUICE EXTRACT, LACTIC ACID, SORBITOL, VITIS VINIFERA (GRAPE) FRUIT EXTRACT, SACCHAROMYCES FERMENT, PASSIFLORA INCARNATA FRUIT EXTRACT, CALENDULA OFFICINALIS FLOWER EXTRACT, MALIC ACID, ARGININE, TOCOPHEROL, PROPANEDIOL, SODIUM LAURATE, ETHYLHEXYLGLYCERIN, CITRIC ACID, SODIUM HYDROXIDE, PENTYLENE GLYCOL, CAPRYLYL GLYCOL, POTASSIUM SORBATE, SODIUM BENZOATE.\n\nPLEASE BE AWARE THAT AS WE CONTINUE TO EVOLVE OUR PRODUCT PORTFOLIO, INGREDIENT LISTS MAY CHANGE OR VARY. PLEASE REFER TO THE INGREDIENT LIST ON THE PRODUCT PACKAGE YOU RECEIVE FOR THE MOST UP TO DATE LIST OF INGREDIENTS, AND REACH OUT TO GTEAM@GLOSSIER.COM WITH ANY QUESTIONS.",
        "similarity_score": 0.6666666666666666
    },
    {
        "name": "Priming Moisturizer Rich",
        "brand": "Glossier",
        "link": "https://www.glossier.com/products/priming-moisturizer-rich?variant=43781983076597",
        "ingredients": "WATER/AQUA/EAU, CAPRYLIC/CAPRIC TRIGLYCERIDE, PROPANEDIOL, GLYCERIN, SQUALANE, ORBIGNYA OLEIFERA SEED OIL, CETEARYL OLIVATE, SORBITAN OLIVATE, PENTAERYTHRITYL TETRAISOSTEARATE, PSEUDOZYMA EPICOLA/CAMELLIA JAPONICA SEED OIL FERMENT EXTRACT FILTRATE, SODIUM HYALURONATE CROSSPOLYMER, CERAMIDE NP, CERAMIDE AP, BUDDLEJA OFFICINALIS FLOWER EXTRACT, LITHOTHAMNION CALCAREUM EXTRACT, HYDROXYETHYL ACRYLATE/SODIUM ACRYLOYLDIMETHYL TAURATE COPOLYMER, AMYLOPECTIN, ACRYLATES/C10‐30 ALKYL ACRYLATE CROSSPOLYMER, SODIUM ACRYLATE/SODIUM ACRYLOYLDIMETHYL TAURATE COPOLYMER, CAPRYLYL/CAPRYL GLUCOSIDE, GLYCERYL STEARATE, CAPRYLYL GLYCOL, CETEARYL ALCOHOL, PENTYLENE GLYCOL, SORBITAN ISOSTEARATE, XANTHAN GUM, 1, 2‐HEXANEDIOL, HYDROXYACETOPHENONE, POLYISOBUTENE, POLYSORBATE 60, LACTIC ACID, POTASSIUM SORBATE, SODIUM BENZOATE, POTASSIUM HYDROXIDE\n\n\nAS WE CONTINUE TO EVOLVE OUR PRODUCT PORTFOLIO, INGREDIENT LISTS MAY CHANGE OR VARY. PLEASE REFER TO THE INGREDIENT LIST ON THE PACKAGE, AND REACH OUT TO GTEAM@GLOSSIER.COM WITH ANY QUESTIONS.",
        "similarity_score": 0.5833333333333333
    },
    {
        "name": "Solution",
        "brand": "Glossier",
        "link": "https://www.glossier.com/products/solution?variant=44623477670133",
        "ingredients": "WATER/AQUA/EAU, SODIUM HYDROXIDE, LACTIC ACID, GLYCOLIC ACID, GLUCONOLACTONE, PROPANEDIOL, PENTYLENE GLYCOL, MAGNESIUM CHLORIDE, GLYCERIN, SALICYLIC ACID, NIACINAMIDE, ALOE BARBADENSIS LEAF JUICE, ETHYLHEXYLGLYCERIN, CITRIC ACID, PHYTIC ACID, POLYSORBATE 20, AMYLOPECTIN, POLYDEXTROSE, DEXTRIN, CAPRYLYL GLYCOL.",
        "similarity_score": 0.5833333333333333
    },
    {
        "name": "Mini Universal Pro-Retinol",
        "brand": "Glossier",
        "link": "https://www.glossier.com/products/mini-universal-pro-retinol?variant=43147973886197",
        "ingredients": "WATER/AQUA/EAU, GLYCERIN, PROPANEDIOL, CETYL ETHYLHEXANOATE, C13-15 ALKANE, CETYL ALCOHOL, BUTYROSPERMUM PARKII (SHEA) BUTTER, CETEARYL OLIVATE, COCONUT ALKANES, SORBITAN OLIVATE, POTASSIUM CETYL PHOSPHATE, BETAINE, RETINYL SUNFLOWERSEEDATE, STEVIA REBAUDIANA LEAF/STEM EXTRACT, OPHIOPOGON JAPONICUS ROOT EXTRACT, CAMELLIA OLEIFERA LEAF EXTRACT, ALOE BARBADENSIS LEAF JUICE, SODIUM HYALURONATE, TOCOPHEROL, COCO-CAPRYLATE/CAPRATE, ETHYLHEXYLGLYCERIN, GLYCOL STEARATE, GLYCERYL STEARATE, CAPRYLIC/CAPRIC TRIGLYCERIDE, MALTODEXTRIN, XANTHAN GUM, BENZOIC ACID, SODIUM HYDROXIDE, CARBOMER, SODIUM ACRYLATE/SODIUM ACRYLOYLDIMETHYL TAURATE COPOLYMER, TRISODIUM ETHYLENEDIAMINE DISUCCINATE.\n\nAS WE CONTINUE TO EVOLVE OUR PRODUCT PORTFOLIO, INGREDIENT LISTS MAY CHANGE OR VARY. PLEASE REFER TO THE INGREDIENT LIST ON THE PACKAGE, AND REACH OUT TO GTEAM@GLOSSIER.COM WITH ANY QUESTIONS.",
        "similarity_score": 0.5833333333333333
    },
    {
        "name": "Super Pure",
        "brand": "Glossier",
        "link": "https://www.glossier.com/products/super-pure?variant=43781981733109",
        "ingredients": "WATER/AQUA/EAU, NIACINAMIDE, GLYCERIN, PROPANEDIOL, ZINC PCA, LONICERA JAPONICA (HONEYSUCKLE) FLOWER EXTRACT, LONICERA CAPRIFOLIUM (HONEYSUCKLE) EXTRACT, CITRIC ACID, ALLANTOIN, HYDROXYETHYLCELLULOSE, POLYSORBATE 60, DISODIUM PHOSPHATE, SODIUM PHOSPHATE.\n\nAS WE CONTINUE TO EVOLVE OUR PRODUCT PORTFOLIO, INGREDIENT LISTS MAY CHANGE OR VARY. PLEASE REFER TO THE INGREDIENT LIST ON THE PACKAGE, AND REACH OUT TO GTEAM@GLOSSIER.COM WITH ANY QUESTIONS.",
        "similarity_score": 0.5833333333333333
    },
    {
        "name": "Universal Pro-Retinol",
        "brand": "Glossier",
        "link": "https://www.glossier.com/products/universal-pro-retinol?variant=43781982159093",
        "ingredients": "WATER/AQUA/EAU, GLYCERIN, PROPANEDIOL, CETYL ETHYLHEXANOATE, C13-15 ALKANE, CETYL ALCOHOL, BUTYROSPERMUM PARKII (SHEA) BUTTER, CETEARYL OLIVATE, COCONUT ALKANES, SORBITAN OLIVATE, POTASSIUM CETYL PHOSPHATE, BETAINE, RETINYL SUNFLOWERSEEDATE, STEVIA REBAUDIANA LEAF/STEM EXTRACT, OPHIOPOGON JAPONICUS ROOT EXTRACT, CAMELLIA OLEIFERA LEAF EXTRACT, ALOE BARBADENSIS LEAF JUICE, SODIUM HYALURONATE, TOCOPHEROL, COCO-CAPRYLATE/CAPRATE, ETHYLHEXYLGLYCERIN, GLYCOL STEARATE, GLYCERYL STEARATE, CAPRYLIC/CAPRIC TRIGLYCERIDE, MALTODEXTRIN, XANTHAN GUM, BENZOIC ACID, SODIUM HYDROXIDE, CARBOMER, SODIUM ACRYLATE/SODIUM ACRYLOYLDIMETHYL TAURATE COPOLYMER, TRISODIUM ETHYLENEDIAMINE DISUCCINATE.\n\nAS WE CONTINUE TO EVOLVE OUR PRODUCT PORTFOLIO, INGREDIENT LISTS MAY CHANGE OR VARY. PLEASE REFER TO THE INGREDIENT LIST ON THE PACKAGE, AND REACH OUT TO GTEAM@GLOSSIER.COM WITH ANY QUESTIONS.",
        "similarity_score": 0.5833333333333333
    }
]